#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/edenmind/openarabic/runs/run-MBYBJhmgtFQmYUhS

Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...
digitalocean_container_registry.repository: Refreshing state... [id=edenmind-oci-repository]
digitalocean_kubernetes_cluster.openarabic: Refreshing state... [id=ca06cffc-e8d5-4850-9c9c-970e196a1fc4]
data.digitalocean_kubernetes_cluster.openarabic: Reading...
data.digitalocean_kubernetes_cluster.openarabic: Read complete after 1s [id=ca06cffc-e8d5-4850-9c9c-970e196a1fc4]
helm_release.metrics-server: Refreshing state... [id=metrics-server]
kubernetes_namespace.openarabic: Refreshing state... [id=openarabic]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # digitalocean_container_registry.repository must be replaced
-/+ resource "digitalocean_container_registry" "repository" {
      ~ created_at             = "2022-06-06 20:05:30 +0000 UTC" -> (known after apply)
      ~ endpoint               = "registry.digitalocean.com/edenmind-oci-repository" -> (known after apply)
      ~ id                     = "edenmind-oci-repository" -> (known after apply)
      ~ name                   = "edenmind-oci-repository" -> "openarabic" # forces replacement
      ~ server_url             = "registry.digitalocean.com" -> (known after apply)
      ~ storage_usage_bytes    = 196540416 -> (known after apply)
      ~ subscription_tier_slug = "starter" -> "basic"
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "TF_VAR_do_token" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-MBYBJhmgtFQmYUhS.plan/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pushed by: @YunusAndreasson, Action: `pull_request`*